export const appid = 'wx752c282e61fdd08a'
export const base = 'https://preprod.api.rwef.richemont.cn'
export const brand = 'CAR'
export const agentId = '1000007'
export const type = 'binding'
export const errInfo = {
  400: '【错误代码400】请求错误，请重试或与管理员联系。',
  500: '【错误代码500】网络错误或技术错误，请与管理员联系。',
  401: '【错误代码401】登录信息错误或已失效，请重试。',
  403: '【错误代码403】无访问权限，请联系管理员。',
  404: '【错误代码404】该信息不存在，请稍后重试或与管理员联系。',
  502: '【错误代码502】连接超时，请与管理员联系。',
  1001: '【错误代码1001】数据错误，请与管理员联系。',
  1004: '【错误代码1004】接口验证失败，请与管理员联系。',
  1303: '【错误代码1303】SA账号的品牌信息错误, 请联系管理员。',
  1603: '【错误代码1603】该微信号已被绑定过，请核对绑定信息是否正确。如无误请与管理员联系。',
  1606: '【错误代码1606】SA账号的店铺信息错误，请联系管理员。',
  1607: '【错误代码1607】该CDB顾客编号已被绑定过，请核对CDB是否正确。如无误请与管理员联系。',
  2003: '【错误代码2003】MDB系统错误，请与管理员联系。',
  9012: '【错误代码9012】SWSE系统错误，请与管理员联系',
  9046: '【错误代码9046】该CDB顾客编号已被绑定过，请核对CDB是否正确。如无误请与管理员联系。',
  9047: '【错误代码9047】该微信号已被绑定过，请核对绑定信息是否正确。如无误请与管理员联系。',
  9048: '【错误代码9048】该用户邮箱已经被注册，请与管理员联系。',
  9056: '【错误代码9056】CDB错误或绑定失败，请与管理员联系。',
  9000: '【错误代码9000】CDB错误或绑定失败，请与管理员联系。',
  999: '【错误代码999】仅允许在历峰安全网络内访问。',
  1610: '【错误代码1610】SA账号信息有误，请与管理员联系。'
}
