export const appid = 'wx752c282e61fdd08a';
export const base = 'https://preprod.api.rwef.richemont.cn'
export const brand = 'CAR'
export const agentId = '1000007'
export const type = 'binding'
export const errInfo = {
    400: '【错误代码400】请求错误，请重试或与管理员联系。',
    500: '【错误代码500】网络错误或技术错误，请与管理员联系。',
    401: '【错误代码401】登录信息错误或已失效，请重试。',
    403: '【错误代码403】无访问权限，请联系管理员。',
    404: '【错误代码404】该信息不存在，请稍后重试或与管理员联系。',
    502: '【错误代码502】连接超时，请与管理员联系。',
    1001: '【错误代码1001】数据错误，请与管理员联系。',
    1004: '【错误代码1004】SA账号验证失败，请与管理员联系。',
    1303: '【错误代码1303】SA账号的品牌信息错误, 请联系管理员。',
    1603: '【错误代码1603】该外部联系人已绑定其他CDB顾客编号，请核对CDB是否正确，如无误请与管理员联系。',
    1606: '【错误代码1606】SA账号的店铺信息错误，请联系管理员。',
    1607: '【错误代码1607】该CDB顾客编号已绑定其他外部联系人微信或SA，请核对CDB是否正确，如无误请与管理员联系。',
    1609: '【错误代码1609】该顾客已不是您的外部联系人，请确认企业微信好友关系，如您还可以与其聊天，请与管理员联系。',
    2003: '【错误代码2003】MDB系统错误，请与管理员联系。',
    9012: '【错误代码9012】SWSE系统错误，请与管理员联系',
    9046: '【错误代码9046】该CDB顾客编号已在其他渠道与用户绑定，请核对CDB是否正确。如无误请与管理员联系。',
    9047: '【错误代码9047】该外部联系人已经在其他渠道与用户绑定，请核对CDB是否正确。如无误请与管理员联系。',
    9048: '【错误代码9048】该用户邮箱已经在SWSE中注册，请核对CDB是否正确。如无误请与管理员联系。',
    9056: '【错误代码9056】NSI绑定失败，请检查CDB中手机号及中英文是否补全，补全后再绑定；如CDB信息全面，请与管理员联系。',
    9000: '【错误代码9000】SWSE绑定失败，请检查CDB中手机号及中英文是否补全，补全后再绑定；如CDB信息全面，请与管理员联系。',
    999: '【错误代码999】仅允许在历峰安全网络内访问。'
}